{
  "class_name": "Model",
  "keras_version": "1.0.6",
  "config": {
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            84,
            84,
            4
          ],
          "name": "input_9",
          "input_dtype": "float"
        },
        "inbound_nodes": [
          
        ],
        "name": "input_9"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_17",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 8,
          "subsample": [
            4,
            4
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 16,
          "border_mode": "valid",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 8
        },
        "inbound_nodes": [
          [
            [
              "input_9",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_17"
      },
      {
        "class_name": "Convolution2D",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "convolution2d_18",
          "activity_regularizer": null,
          "trainable": true,
          "dim_ordering": "tf",
          "nb_col": 4,
          "subsample": [
            2,
            2
          ],
          "init": "glorot_uniform",
          "bias": true,
          "nb_filter": 32,
          "border_mode": "valid",
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "nb_row": 4
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_17",
              0,
              0
            ]
          ]
        ],
        "name": "convolution2d_18"
      },
      {
        "class_name": "Flatten",
        "config": {
          "trainable": true,
          "name": "flatten_9"
        },
        "inbound_nodes": [
          [
            [
              "convolution2d_18",
              0,
              0
            ]
          ]
        ],
        "name": "flatten_9"
      },
      {
        "class_name": "Dense",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "dense_25",
          "activity_regularizer": null,
          "trainable": true,
          "init": "glorot_uniform",
          "bias": true,
          "input_dim": null,
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "output_dim": 256
        },
        "inbound_nodes": [
          [
            [
              "flatten_9",
              0,
              0
            ]
          ]
        ],
        "name": "dense_25"
      },
      {
        "class_name": "RepeatVector",
        "config": {
          "trainable": true,
          "name": "repeatvector_9",
          "n": 1
        },
        "inbound_nodes": [
          [
            [
              "dense_25",
              0,
              0
            ]
          ]
        ],
        "name": "repeatvector_9"
      },
      {
        "class_name": "LSTM",
        "config": {
          "U_regularizer": null,
          "name": "lstm_9",
          "inner_activation": "hard_sigmoid",
          "go_backwards": false,
          "activation": "tanh",
          "trainable": true,
          "unroll": false,
          "consume_less": "cpu",
          "stateful": false,
          "init": "glorot_uniform",
          "inner_init": "orthogonal",
          "dropout_U": 0,
          "dropout_W": 0,
          "input_dim": 256,
          "return_sequences": false,
          "b_regularizer": null,
          "W_regularizer": null,
          "output_dim": 256,
          "forget_bias_init": "one",
          "input_length": null
        },
        "inbound_nodes": [
          [
            [
              "repeatvector_9",
              0,
              0
            ]
          ]
        ],
        "name": "lstm_9"
      },
      {
        "class_name": "Dense",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "dense_26",
          "activity_regularizer": null,
          "trainable": true,
          "init": "glorot_uniform",
          "bias": true,
          "input_dim": null,
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "softmax",
          "output_dim": 6
        },
        "inbound_nodes": [
          [
            [
              "lstm_9",
              0,
              0
            ]
          ]
        ],
        "name": "dense_26"
      },
      {
        "class_name": "Dense",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "dense_27",
          "activity_regularizer": null,
          "trainable": true,
          "init": "glorot_uniform",
          "bias": true,
          "input_dim": null,
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "linear",
          "output_dim": 1
        },
        "inbound_nodes": [
          [
            [
              "dense_25",
              0,
              0
            ]
          ]
        ],
        "name": "dense_27"
      }
    ],
    "input_layers": [
      [
        "input_9",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_26",
        0,
        0
      ],
      [
        "dense_27",
        0,
        0
      ]
    ],
    "name": "model_9"
  }
}
